COMMERCIAL = "Коммерческое помещение"
FLAT = "Квартира"
HOUSE = "Дом"

NEW_BUILDING = "Новостройка"
SECONDARY = "Вторичка"

BUSINESS = "Бизнес"
COMFORT = "Комфорт"
PREMIUM = "Премиум"

RU_EN_DICTIONARY = {
    "Коммерческое помещение": "commerce",
    "Квартира": "flat",
    "Дом": "house",

    "Новостройка": "new",
    "Вторичка": "secondary",

    "Бизнес": "business",
    "Комфорт": "comfort",
    "Премиум": "premium",
    
    "Разработка дизайн-проекта": "design_project",
    "Ремонт под ключ": "repair",
    "Ремонтно-строительные работы": "works",
    "Комплектация": "equipment",
    "Авторский надзор": "supervision",
    "Консультация": "consulting"
}

EN_RU_DICTIONARY = {
    "commerce": "Коммерческое помещение",
    "flat": "Квартира",
    "house": "Дом",

    "new": "Новостройка",
    "secondary": "Вторичка",

    "business": "Бизнес",
    "comfort": "Комфорт",
    "premium": "Премиум",

    "design_project": "Разработка дизайн-проекта",
    "repair": "Ремонт под ключ",
    "works": "Ремонтно-строительные работы",
    "equipment": "Комплектация",
    "supervision": "Авторский надзор",
    "consulting": "Консультация"
}

COMMERCIAL_EN = "commerce"
FLAT_EN = "flat"
HOUSE_EN = "house"

NEW_BUILDING_EN = "new"
SECONDARY_EN = "secondary"

BUSINESS_EN = "business"
COMFORT_EN = "comfort"
PREMIUM_EN = "premium"


COMMIT = "Оставить заявку"
AGAIN = "Заполнить заново"

CREATE_ORDER = "Создать заявку"

MAIN_MENU = "Главное меню"

MORE_INFO = "Узнать подробнее"

CALCULATE_COST = "Рассчитать стоимость"

ABOUT_CATEGORIES = "О категориях ремонта"
DESIGN_PROJECT = "Дизайн-проект"
ABOUT_US = "Как мы работаем?"
PORTFOLIO = "Посмотреть портфолио"

NEXT = "Следующий"
GO_BACK = "Вернуться в меню"

# Section 1

FIRST_START_MESSAGE = ("MetaDesign - от идеи до заселения:\n\n"
                       "• 46 завершенных объектов под ключ за 2023;\n\n"

                       "• Более 20 ЖК Москвы в нашем портфолио: CityBay, Alia, Архитектор, Ilove, Welton Towers, Level "
                       "Причальный, PrimePark, ВТБ Арена Парк и т.д.;\n\n"

                       "• Сотрудничаем более чем со 100 партнёрами: Profil Doors, Стильные кухни, Laparet, "
                       "KeramaMarazzi, KuppersBuch, Bork, Asko, ЦентрСвет, OdeonLight, Maytoni, "
                       "BoConcept, Grohe, Omoikiri, Finex и др.\n\n"

                       "Наша ответственность, профессионализм и внимание к "
                       "деталям приведут вас к желаемому идеальному результату. "
                       "Начните прямо сейчас воплощать ваши мечты "
                       "в реальность вместе с нами!")

SECOND_START_MESSAGE = ("<b>Что дальше?</b>\n"

                        "Вы можете рассчитать примерную <b>стоимость ремонта</b> своей "
                        "недвижимости <b>под ключ</b> по кнопкам ниже. Быстро, онлайн и бесплатно.\n"

                        "А еще познакомиться с уже выполненными проектами MetaDesign в портфолио "
                        "и записаться на экскурсию по готовым объектам, чтобы убедиться в качестве нашей работы.")

# Section 2

FIRST_ABOUT_CATEGORIES = ("Комфорт или бизнес: что выбрать?\n\n"
                          "В стоимость ремонта каждой категории включено:\n"
                          "• Строительно-монтажные работы;\n"
                          "• Черновые и чистовые отделочные материалы;\n"
                          "• Полис страхования;\n"
                          "• Освещение, электрика, розетки, выключатели;\n"
                          "• Сантехника черновая и чистовая;\n"
                          "• Межкомнатные двери;\n"
                          "• Мебель: кухонный гарнитур, системы хранения, корпусная и мягкая мебель, "
                          "обеденная группа;\n"
                          "• Бытовая техника: варочная панель, вытяжка, посудомоечная машина, "
                          "СВЧ, духовой шкаф, холодильник;\n"
                          "• Клининг по окончании ремонта;\n"
                          "• Текстиль: шторы, ковры;\n"
                          "• Декор.\n\n"

                          "Дополнительные опции (не включено в стоимость ремонта):\n"
                          "• Шумоизоляция;\n"
                          "• Замена входной двери;\n"
                          "• Система кондиционирования;\n"
                          "• Замена стеклопакетов;\n"
                          "• Замена радиаторов отопления;\n"
                          "• Система умный дом;\n"
                          "• Межкомнатные двери нестандартного размера;\n"
                          "• Дополнительная техника: стиральная и сушильная машины, телевизор/проектор, "
                          "винный шкаф, паровая система для одежды.")

SECOND_ABOUT_CATEGORIES = ("Категория ремонта “Бизнес” отличается от “Комфорта” классом отделочных материалов, мебели,"
                           " освещения, сантехники и т.д. \n"
                           "Например, в категории «Комфорт» в качестве напольного покрытия мы "
                           "используем ламинат 33 класса, в категории Бизнес - паркетная/инженерная доска. "
                           "Кухня в категории «Комфорт» выполнена со столешницей из HPL-пластика и  фасадами в "
                           "пленке, в категории «Бизнес» - столешница из искусственного камня, "
                           "а фасады в пластике/эмали.")

# Section 3

ABOUT_DESIGN_PROJECT = ("<b>Как выглядит дизайн-проект в MetaDesign?</b>\n\n"
                        "<b>Состав дизайн-проекта</b> может варьироваться в зависимости от специфики и масштаба "
                        "проекта, "
                        "но в общем случае включает следующие ключевые элементы:\n\n"
                        "• Техническое задание: определение целей и задач проекта, описание пожеланий клиента, "
                        "функциональных требований и бюджета;\n"
                        "• Исходные данные: снимки и замеры помещения, анализ существующих условий (освещение, "
                        "вентиляция, электрика и т.д.);\n"
                        "• Разработка планировочных решений: 3-4 функциональные схемы расстановки мебели и "
                        "оборудования, зонирование пространства;\n"
                        "• Эскизные решения, коллажирование: предварительные концептуальные наброски и идеи, "
                        "определение стиля и цветовой палитры, составление ТЗ для визуализатора;\n"
                        "• Составление спецификации: подбор материалов для отделки стен, пола, потолка, "
                        "выбор текстиля, мебели, оборудования с указанием количества и ссылками;\n"
                        "• 3D-визуализации: фотореалистичные изображения интерьера, позволяющие представить конечный "
                        "результат;\n"
                        "• Разработка рабочих чертежей, проектной документации: подробные чертежи для реализации "
                        "проекта (схемы, планы, разрезы, узлы), инженерные схемы (электрика, сантехника).\n\n"

                        "Каждый из этих элементов играет важную роль в успешной реализации дизайн-проекта и помогает "
                        "обеспечить соответствие конечного результата ожиданиям клиента.\n"
                        "АВТОРСКИЙ НАДЗОР <b>В ПОДАРОК</b> ПРИ ЗАКАЗЕ <b>РЕМОНТА ПОД КЛЮЧ!</b>")

# Section 4

ABOUT_COMPANY = ("<b>Как мы работаем?</b>\n"
                 "MetaDesign - команда профессионалов, "
                 "которых объединяет страсть к дизайну и уважение к вашим желаниям. \n\n"

                 "Наши ориентиры:\n"
                 "<b>• Целостность процесса</b>\n"
                 "Мы предлагаем полный цикл услуг — от первоначальной концепции до финального заселения."
                 " Это позволяет нам контролировать каждую деталь и гарантировать высокое качество на каждом этапе. "
                 "Мы верим, что внимание к мелочам определяет общий результат.\n\n"

                 "<b>• Партнёрство на каждом этапе</b>\n"
                 "Мы ценим доверие и открытость в отношениях с клиентами. "
                 "На каждом этапе проекта мы поддерживаем прозрачное общение, чтобы вы всегда знали, "
                 "что происходит, и чувствовали себя частью процесса.\n\n"

                 "<b>• Эмоциональная связь</b>\n"
                 "Мы понимаем, что дом — это место, где создаются воспоминания и формируются эмоции. "
                 "Наша задача — создать атмосферу, которая будет вдохновлять, "
                 "успокаивать и радовать вас каждый день.\n\n"

                 "Наша ответственность, профессионализм и внимание к "
                 "деталям приведут вас к желаемому идеальному результату🤍")

# Portfolio
CASES = [("ЖК Кит\n"
          "Метраж: 60 м2\n"
          "г. Мытищи\n"),
         ("ЖК Триколор\n"
          "Метраж: 128 м2\n"
          "г. Москва\n"),
         ("ЖК Династия\n"
          "Метраж: 40 м2\n"
          "г. Москва\n"),
         ("ЖК Зиларт\n"
          "Метраж: 78 м2\n"
          "г. Москва\n"),
         ("ЖК Level Причальный\n"
          "Метраж: 47 м2\n"
          "г. Москва\n"),
         ("ЖК Триколор\n"
          "Метраж: 107 м2\n"
          "г. Москва\n"),
         ("ЖК Лесобережный\n"
          "Метраж: 60 м2\n"
          "г. Красногорск\n"),
         ("ЖК GreenPark\n"
          "Метраж: 80 м2\n"
          "г. Москва\n")]

