COMMERCIAL = "Коммерческое помещение"
FLAT = "Квартира"
HOUSE = "Дом"

NEW_BUILDING = "Новостройка"
SECONDARY = "Вторичка"

BUSINESS = "Бизнес"
COMFORT = "Комфорт"

COMMIT = "Оставить заявку"
AGAIN = "Заполнить заново"

CREATE_ORDER = "Создать заявку"

MAIN_MENU = "Главное меню"

MORE_INFO = "Узнать подробнее"

CALCULATE_COST = "Рассчитать стоимость"

ABOUT_CATEGORIES = "О категориях ремонта"


# Section 1

FIRST_START_MESSAGE = ("MetaDesign - от идеи до заселения:\n\n"
                       "- 46 завершенных объектов под ключ за 2023;\n\n"
                       
                       "- Более 20 жК Москвы В нашем портфолио: CityBay, Alia, Архитектор, Ilove, Welton Towers, Level "
                       "Причальный, PrimePark, ВТБ Арена Парк и т.д.;\n\n"
                       
                       "- Сотрудничаем более чем с 74 партнёрами: Profil Doors, Стильные кухни, Laparet, "
                       "KeramaMarazzi, KuppersBuch, Bork, Asko, ЦентрСвет, OdeonLight, Maytoni, "
                       "BoConcept, Grohe, Omoikiri, Finex и др.\n\n"
                       
                       "Мы гарантируем, что наше внимание к деталям, профессионализм и ответственность, приведут "
                       "вас к уникальному дизайну и идеальному ремонту. Начните прямо сейчас воплощать ваши мечты "
                       "в реальность вместе с нами!")

SECOND_START_MESSAGE = ("<b>Что дальше?</b>\n"
                        
                        "Вы можете рассчитать примерную <b>стоимость ремонта</b> своей "
                        "недвижимости <b>под ключ</b> по кнопкам ниже. Быстро, онлайн и бесплатно.\n"
                        
                        "А еще познакомиться с уже выполненными проектами MetaDesign в портфолио"
                        "и записаться на экскурсию по готовым объектам, чтобы убедиться в качестве нашей работы.")

# Section 2



